/********************************************************************************
*AI                                                                             *
*处理AD数据，计算V、I、Vfd、Ifd。                                               *
********************************************************************************/
void Init_AD_Data(void);

void AD(void);

void Cal_AD(void);

void Cal_Avg(void);

float Get_Medium_Value(float a, float b, float c);

void Shift_AD_Data(void);

void Zero_Calibrate(void);
//===========================================================================
// End of file.
//===========================================================================
