/***************************************************************************************
*文件名称   optical_fiber.h  
*作者  		Three Gorges Nengshida Electric Co.,Ltd
*版本 		NSD_STM32F2_Driver_6.0
*修订日期   2013-11-14
*备注  		光纤通信
****************************************************************************************
*使用说明																			*
***************************************************************************************/
/* Define to prevent recursive inclusion ---------------------------------------------*/
#ifndef __OPTICAL_FIBER_H
#define __OPTICAL_FIBER_H

/***************************************************************************************
*函数名：Optical_fiber_Init												*
*功  能：光纤通信初始化函数    				      			 			*
*参  数：BaudRate：	 设置串口通信的波特率，	该值必须能被1382400整除		*
***************************************************************************************/ 
void Optical_fiber_Init(uint32_t BaudRate);

/***************************************************************************************
*函数名：Tx_Buffer														*
*功  能：串口字符串发送函数    				      			 			*
*参  数：port 串口通道选择												*
		 	 - 0  ：串口1、2、3、4、5和6广播发送						*
		 	 - 1  ：串口1												*
		 	 - 2  ：串口2												*
		 	 - 3  ：串口3												*
		 	 - 4  ：串口4												*
		 	 - 5  ：串口5												*
		 	 - 6  ：串口6												*
			 - 100：串口1、2、3和4广播发送								*
			 - 101：串口5和6广播发送									*
		 data[] 数据发送缓冲区											*
		 len 数据发送长度											    *
***************************************************************************************/ 
void Tx_Buffer(uint16_t port,uint8_t data[], uint16_t len);

/***************************************************************************************
*函数名：Rx_Buffer														*
*功  能：串口数据接收函数	   				      		 				*
*参  数：port 串口通道选择												*
		 	 - 1：串口1													*
		 	 - 2：串口2													*
		 	 - 3：串口3													*
		 	 - 4：串口4													*
		 	 - 5：串口5													*
		 	 - 6：串口6													*
		 data[] 数据接收缓冲区											*
*返回值：数据接收长度													*
***************************************************************************************/ 
uint16_t Rx_Buffer(uint16_t port, uint8_t data[]);


#endif


/******* (C) COPYRIGHT 2013 Three Gorges Nengshida Electric Co.,Ltd *****END OF FILE***/
